test/data/convert/self-billed-invoice.json

{
	"$schema": "https://gobl.org/draft-0/envelope",
	"head": {
		"uuid": "8a51fd30-2a27-11ee-be56-0242ac120002",
		"dig": {
			"alg": "sha256",
			"val": "c91e9e9492a31026dea7e139fffee9bf1dc22848f2a7762caa2f5d3e599c625e"
		}
	},
	"doc": {
		"$schema": "https://gobl.org/draft-0/bill/invoice",
		"$regime": "DE",
		"$addons": [
			"eu-en16931-v2017"
		],
		"$tags": [
			"self-billed"
		],
		"uuid": "019231f1-9184-7eb6-8216-12db835e52a1",
		"type": "standard",
		"series": "SAMPLE",
		"code": "001",
		"issue_date": "2024-02-13",
		"currency": "EUR",
		"tax": {
			"ext": {
				"untdid-document-type": "389"
			}
		},
		"supplier": {
			"name": "Provide One GmbH",
			"tax_id": {
				"country": "DE",
				"code": "111111125"
			},
			"people": [
				{
					"name": {
						"given": "John",
						"surname": "Doe"
					}
				}
			],
			"addresses": [
				{
					"num": "16",
					"street": "Dietmar-Hopp-Allee",
					"locality": "Walldorf",
					"code": "69190",
					"country": "DE"
				}
			],
			"emails": [
				{
					"addr": "billing@example.com"
				}
			],
			"telephones": [
				{
					"num": "+49100200300"
				}
			]
		},
		"customer": {
			"name": "Sample Consumer",
			"tax_id": {
				"country": "DE",
				"code": "282741168"
			},
			"addresses": [
				{
					"num": "25",
					"street": "Werner-Heisenberg-Allee",
					"locality": "München",
					"code": "80939",
					"country": "DE"
				}
			],
			"emails": [
				{
					"addr": "email@sample.com"
				}
			]
		},
		"lines": [
			{
				"i": 1,
				"quantity": "20",
				"item": {
					"name": "Development services",
					"price": "90.00",
					"unit": "h"
				},
				"sum": "1800.00",
				"taxes": [
					{
						"cat": "VAT",
						"rate": "standard",
						"percent": "19%",
						"ext": {
							"untdid-tax-category": "S"
						}
					}
				],
				"total": "1800.00"
			}
		],
		"ordering": {
			"code": "XR-2024-2"
		},
		"payment": {
			"payee": {
				"name": "Ebeneser Scrooge AS",
				"identities": [
					{
						"label": "CompanyID",
						"code": "989823401"
					},
					{
						"label": "0088",
						"code": "2298740918237"
					}
				]
			},
			"terms": {
				"due_dates": [
					{
						"date": "2013-07-20",
						"amount": "2142.00",
						"percent": "100%"
					}
				],
				"notes": "2 % discount if paid within 2 days\n            Penalty percentage 10% from due date"
			},
			"instructions": {
				"key": "credit-transfer",
				"ref": "0003434323213231",
				"credit_transfer": [
					{
						"iban": "NO9386011117947",
						"bic": "DNBANOKK"
					}
				],
				"ext": {
					"untdid-payment-means": "30"
				}
			}
		},
		"totals": {
			"sum": "1800.00",
			"total": "1800.00",
			"taxes": {
				"categories": [
					{
						"code": "VAT",
						"rates": [
							{
								"key": "standard",
								"ext": {
									"untdid-tax-category": "S"
								},
								"base": "1800.00",
								"percent": "19%",
								"amount": "342.00"
							}
						],
						"amount": "342.00"
					}
				],
				"sum": "342.00"
			},
			"tax": "342.00",
			"total_with_tax": "2142.00",
			"payable": "2142.00"
		}
	}
}